# chapter1.4：实验任务一

## 实验目的
- 实现设备：2950T-24交换机一台，2950-24交换机两台，PC六台
- 使用交换机划分出3个虚拟局域网络，分别为VLAN 10,VLAN 20以及VLAN 30,验证VLAN间通信。
- VLAN 10接入PC(A1,A2),VLAN 20接入pc(B1,B2),VLAN 30接入pc(C1,C2)
- 验证生成树协议STP作用。

## 实验环境配置
![spanning tree protocal](chapter1/img/stp.png)

### 配置交换机划分vlan

1.对交换机0进行配置（划分为vlan 10与vlan 30)

step1:给VLAN指定一个ID，并命名
```bash
Switch(config)#vlan 10
Switch(config-vlan)#name A
Switch(config-vlan)#exit
Switch(config)#vlan 30
Switch(config-vlan)#name C
Switch(config)#vlan 20
Switch(config-vlan)#name B
```
step2:给VLAN分配端口,fastEthernet0/1为VLAN 10端口，fastEthernet0/3为VLAN 30端口。
```shell
Switch(config)#interface fastEthernet0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/3
Switch(config-if)#switchport access vlan 30
```
step3:给vlan分配fastEthernet0/22与fastEthernet0/24端口，并将它们设置为trunk port.
```shell
Switch(config)#interface fastEthernet0/22
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/24
Switch(config-if)#switchport mode trunk
```
step4:选择生成树模式
```shell
Switch(config)#spanning-tree mode rapid-pvst
```
step5:保存当前设置，交换机关机重启后自动加载设置。
```shell
Switch#copy running-config startup-config
```
  
2.对交换机1进行配置    
  
较交换机0仅需修改step2,3与step4.  

```shell
Switch(config)#interface fastEthernet0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/2
Switch(config-if)#switchport access vlan 20
```  

```shell
Switch(config)#interface fastEthernet0/22
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/23
Switch(config-if)#switchport mode trunk
```

```shell
Switch(config-if)#switchport trunk allowed vlan 10,20
```
