# chapter1.4：实验任务一

## 实验目的
- 实现设备：2950T-24交换机一台，2950-24交换机两台，PC六台
- 使用交换机划分出3个虚拟局域网络，分别为VLAN 10,VLAN 20以及VLAN 30,验证VLAN间通信。
- VLAN 10接入PC(A1,A2),VLAN 20接入pc(B1,B2),VLAN 30接入pc(C1,C2)
- 验证生成树协议STP作用。
<blockquote>Notice:先配置生成树，后连线，避免广播风暴。</blockquote>

## 实验环境配置

### 配置交换机划分vlan

1.对交换机0进行配置（划分为vlan 10与vlan 30)

step1:给VLAN指定一个ID，并命名
```bash
Switch(config)#vlan 10
Switch(config-vlan)#name A
Switch(config-vlan)#exit
Switch(config)#vlan 30
Switch(config-vlan)#name C
Switch(config)#vlan 20
Switch(config-vlan)#name B
```
step2:给VLAN分配端口,<code>fastEthernet0/1</code>为VLAN 10端口，fastEthernet0/3为VLAN 30端口。
```shell
Switch(config)#interface fastEthernet0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/3
Switch(config-if)#switchport access vlan 30
```
step3:给vlan分配<code>fastEthernet0/22</code>与<code>fastEthernet0/24</code>端口，并将它们设置为trunk port.
```shell
Switch(config)#interface fastEthernet0/22
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/24
Switch(config-if)#switchport mode trunk
```
step4:选择生成树模式
```shell
Switch(config)#spanning-tree mode rapid-pvst
```
step5:保存当前设置，交换机关机重启后自动加载设置。
```shell
Switch#copy running-config startup-config
```
  
2.对交换机1进行配置     

```shell
Switch(config)#vlan 10
Switch(config-vlan)#name A
Switch(config-vlan)#exit
Switch(config)#vlan 20
Switch(config-vlan)#name B
Switch(config)#vlan 30
Switch(config-vlan)#name C
Switch(config)#interface fastEthernet0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/2
Switch(config-if)#switchport access vlan 20
Switch(config)#interface fastEthernet0/22
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#interface fastEthernet0/23
Switch(config-if)#switchport mode trunk
Switch(config)#spanning-tree mode rapid-pvst
Switch#copy running-config startup-config
```
3.交换机2配置方式与交换机0，1完全一致

### 配置PC

- A1(IP:192.168.13.108 submask:255.255.255.0)
- A2(IP:192.168.13.208 submask:255.255.255.0)
- B1(IP:192.168.23.108 submask:255.255.255.0)
- B2(IP:192.168.23.208 submask:255.255.255.0)
- C1(IP:192.168.33.108 submask:255.255.255.0)
- C2(IP:192.168.33.208 submask:255.255.255.0)  
  
### 实验过程
由拓扑结构图可看出，初始状态下，交换机2的<code>fastEthernet0/23</code>端口显示为橙色，为阻塞状态。抑或使用<code>show spanning-tree</code>命令查看交换机的中继端口状态。
```shell
Switch#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     000D.BD9C.AB5A
             Cost        19
             Port        24(FastEthernet0/24)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC35.E266
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/24           Root FWD 19        128.24   P2p
Fa0/23           Altn BLK 19        128.23   P2p

VLAN0010
  Spanning tree enabled protocol rstp
  Root ID    Priority    32778
             Address     000D.BD9C.AB5A
             Cost        19
             Port        24(FastEthernet0/24)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32778  (priority 32768 sys-id-ext 10)
 --More-- 
```
1.初始状态下对PC进行ping指令操作  
*case 1*:A1 ping A2，C1 ping C2  
*result*：相同vlan间通信正常
```shell
C:\>ping 192.168.13.208

Pinging 192.168.13.208 with 32 bytes of data:

Reply from 192.168.13.208: bytes=32 time<1ms TTL=128
Reply from 192.168.13.208: bytes=32 time<1ms TTL=128
Reply from 192.168.13.208: bytes=32 time<1ms TTL=128
Reply from 192.168.13.208: bytes=32 time<1ms TTL=128

Ping statistics for 192.168.13.208:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms

```

```shell
C:\>ping 192.168.33.208

Pinging 192.168.33.208 with 32 bytes of data:

Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128

Ping statistics for 192.168.33.208:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms

```
*case 2*:B1 ping C2  
*result*:不同vlan间不可通信。
```shell
C:\>ping 192.168.33.208

Pinging 192.168.33.208 with 32 bytes of data:

Request timed out.
Request timed out.
Request timed out.
Request timed out.

Ping statistics for 192.168.33.208:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
```
2.更改网络的拓扑结构，将交换机0的<code>fastEthernet0/24</code>端口关闭，观察spanning-tree算法生成的新网络拓扑，并验证其是否无环。  
*case 1*:关闭<code>fastEthernet0/24</code>端口,观察交换机2的<code>fastEthernet0/23</code>端口的变化。 
*result*:原来交换机2的<code>fastEthernet0/23</code>端口由阻塞态变为转发态，通信链路成功切换。  
```shell
Switch(config)#interfa fast
Switch(config)#interfa fastEthernet0/24
Switch(config-if)#shutdown
```

```shell
Switch#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     000D.BD9C.AB5A
             Cost        38
             Port        23(FastEthernet0/23)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC35.E266
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/23           Root FWD 19        128.23   P2p

VLAN0010
  Spanning tree enabled protocol rstp
  Root ID    Priority    32778
             Address     000D.BD9C.AB5A
             Cost        38
             Port        23(FastEthernet0/23)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32778  (priority 32768 sys-id-ext 10)
 --More-- 
```

*casse 2*:验证通信链路切换后，是否能够正常通信。  
*result*：通信正常
```shell

C:\>ping 192.168.33.208

Pinging 192.168.33.208 with 32 bytes of data:

Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128
Reply from 192.168.33.208: bytes=32 time<1ms TTL=128

Ping statistics for 192.168.33.208:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms
```


